Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopyLevelsOrRefPlanesToNonMassFamily Property
 Can't copy levels or reference planes to families that are not Mass families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopyLevelsOrRefPlanesToNonMassFamily { get; }
Public Shared ReadOnly Property CantCopyLevelsOrRefPlanesToNonMassFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopyLevelsOrRefPlanesToNonMassFamily {
	FailureDefinitionId^ get ();
}
static member CantCopyLevelsOrRefPlanesToNonMassFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace